# GetHomeCamera Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewNavigationToolSettings..::..GetHomeCamera Method
ViewNavigationToolSettings Class See Also
---
Gets a copy of the structure containing information about the store Home view orientation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public HomeCamera GetHomeCamera()
```

Visual Basic
---
```text
Public Function GetHomeCamera As HomeCamera
```

Visual C++
---
```text
public:
HomeCamera^ GetHomeCamera()
```

# ### Return Value
A copy of the structure containing information about the store Home view orientation, or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no home view set for this document.
# See Also
ViewNavigationToolSettings Class
Autodesk.Revit.DB Namespace